app/controllers/categories_controller.rb

  def show
    if logged_in?
      @spendings = @category.spendings
      @plan = Plan.find(@category.plan_id)
---
SELECT  "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT 1  [["id", 1]]
SELECT "spendings".* FROM "spendings" WHERE "spendings"."category_id" = ?  [["category_id", 2]]

  def create
    @category = @plan.categories.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "description", "budget", "integer", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "categoria 1"], ["description", "hola"], ["budget", "2000000"], ["integer", "otra wea"], ["created_at", "2016-09-09 23:53:40.027197"], ["updated_at", "2016-09-09 23:53:40.027197"]]

  def update
    respond_to do |format|
      if @category.update(category_params)
---
UPDATE "categories" SET "description" = ?, "budget" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["description", "estay weando "], ["budget", 15000], ["updated_at", "2016-09-13 21:47:56.882256"], ["id", 4]]