app/controllers/plans_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
SELECT "categories".* FROM "categories" WHERE "categories"."plan_id" = ?  [["plan_id", 1]]
---
  def show
    if logged_in?
      @categories = @plan.categories
      @user = User.find(@plan.user_id)

INSERT INTO "plans" ("name", "budget", "description", "start_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Primero"], ["budget", 200], ["description", "UNAS minas doreas"], ["start_date", "2016-09-10"], ["created_at", "2016-09-10 03:04:10.612361"], ["updated_at", "2016-09-10 03:04:10.612361"]]
---
  def create
    @plan = @user.plans.new(plan_params)

    respond_to do |format|
      if @plan.save