app/controllers/spendings_controller.rb

  def show
    if logged_in?
      @category = Category.find(@spending.category_id)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 3]]

  def create
    @spending = @category.spendings.new(spending_params)

    respond_to do |format|
      if @spending.save
---
INSERT INTO "spendings" ("name", "descrption", "planned", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "hola"], ["descrption", "unas minas"], ["planned", "t"], ["date", "2016-09-10"], ["created_at", "2016-09-10 00:31:01.150450"], ["updated_at", "2016-09-10 00:31:01.150450"]]

  def update
    respond_to do |format|
      if @spending.update(spending_params)
---
UPDATE "spendings" SET "name" = ?, "amount" = ?, "updated_at" = ? WHERE "spendings"."id" = ?  [["name", "Bajon"], ["amount", 4000], ["updated_at", "2016-09-13 21:54:18.474146"], ["id", 10]]

    def set_spending
      @spending = Spending.find(params[:id])
---
SELECT  "spendings".* FROM "spendings" WHERE "spendings"."id" = ? LIMIT 1  [["id", 4]]