app/controllers/users_controller.rb

  def index
    redirect_to plans_path
    @users = User.all
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "budget", "password_digest", "date_birth", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)