app/views/plans/index.html.erb

      <div class="button-container-content">
        <%plan.categories.each do |cat| %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."plan_id" = ?  [["plan_id", 1]]