app/views/plans/show.html.erb

SELECT "spendings".* FROM "spendings" WHERE "spendings"."category_id" = ?  [["category_id", 1]]
---
      <div class="button-container-content">
        <%category.spendings.each do |spend| %>